caseFiles/sFoam2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    conductingwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       7080;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       7140;
    }
    top
    {
        type            patch;
        nFaces          60;
        startFace       7260;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7200;
        startFace       7320;
    }
)

// ************************************************************************* //
