caseFiles/sFoam2D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
    Cp              4186;
    kappa       17.9;
    mu          1.1e-3;
    D           1e-9;
    DAS         1.85e-4;
}

air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
    Cp              1;
    kappa           1.0;
    mu              1.48e-05;
    D               1e-9;
    betaT           1e-4;
    betaC           0.01;
    TRef            300;
    CRef            0.48;
}

sigma            0.07;

// ************************************************************************* //
