caseFiles/sFoam2D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volScalarFieldValue T 298
    volScalarFieldValue Y  0
    
    
);

regions
(
    boxToCell
    {
        box (0 0 -1) (0.1 0.05 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue T 923
            volScalarFieldValue Y  0.04
            
        );
    }
);


// ************************************************************************* //
